# AWS `S3` upload, followed by `Athena` tables
* Author: Juan Pablo Triana Martinez
* Institution: University of San Diego
* Course: AAI-540 Machine Learning Operations

The following jupyter notebook contains all of the steps necessary in order to upload the desired `pd.DataFrames` to `s3`, and then retrieve `Athena` tables.

Let's begin!

In [1]:
# Import necessary modules
import os
import pandas as pd

In [2]:
# Let's see the current directory
os.getcwd()

'/home/sagemaker-user/AAI-540-Group-8/notebooks'

In [3]:
# Let's retrieve the data from the `src` folder found at a higher level
!pwd

/home/sagemaker-user/AAI-540-Group-8/notebooks

In [4]:
directory_above = os.path.abspath(os.path.dirname(os.getcwd()))
directory_above

'/home/sagemaker-user/AAI-540-Group-8'

In [5]:
# Set the os.chdir here
os.chdir(directory_above)

In [6]:
!pwd

/home/sagemaker-user/AAI-540-Group-8

In [7]:
from src import get_stocks_data_yahoo

In [16]:
# Let's create the different tickets for NYMEX oil and COMEX gold
future_tickers = ["CL=F","GC=F"]

# West Texas Intermediate Barrel
list_dfs = get_stocks_data_yahoo(
    tickers=future_tickers, start_date="1980-01-01", end_date="2026-01-29")

[*********************100%***********************]  2 of 2 completed

In [17]:
# Let's see the shape of each of the dataframes to upload
for df in list_dfs:
    print(df.shape)

(6386, 7)
(6386, 7)

In [18]:
list_dfs[0].head()

        Date      Close       High        Low       Open   Volume Ticker
0 2000-08-23  32.049999  32.799999  31.950001  31.950001  79385.0   CL=F
1 2000-08-24  31.629999  32.240002  31.400000  31.900000  72978.0   CL=F
2 2000-08-25  32.049999  32.099998  31.320000  31.700001  44601.0   CL=F
3 2000-08-28  32.869999  32.919998  31.860001  32.040001  46770.0   CL=F
4 2000-08-29  32.720001  33.029999  32.560001  32.820000  49131.0   CL=F